# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a =  pd.Series([100,200,300,400])

Print a, and data type

In [3]:
print(a), type(a)

0    100
1    200
2    300
3    400
dtype: int64

(None, pandas.core.series.Series)

Using indexing access the element 300 from the series a.

In [4]:
a[2]

300

What are the values of index for series a?

In [5]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
new_index = ['c', 'a', 'b', 'd']

a.index = new_index

print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
a['d']

400

Sort the values wrt to the index and print it

In [8]:
sorted_index = a.sort_index()

sorted_index

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [9]:
b = pd.Series({'e':800,'f':450,'g':100})

print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
a = a.append(b)

C:\Users\USER\AppData\Local\Temp\ipykernel_16908\1744623784.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a = a.append(b)

In [11]:
#print a again after appending b into it

print(a)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
sorted_a = a.sort_values(ascending=False)
sorted_a

e    800
f    450
d    400
b    300
a    200
c    100
g    100
dtype: int64

In [13]:
print("Sorted index of a:", sorted_a.index)

Sorted index of a: Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [14]:
df = pd.DataFrame(a, columns=['values']) 

df

   values
c     100
a     200
b     300
d     400
e     800
f     450
g     100

In [15]:
df.shape

(7, 1)

What is the index of the dataframe, is it same as the series 'a'

In [16]:
# yep its same as the series.

df.index

Index(['c', 'a', 'b', 'd', 'e', 'f', 'g'], dtype='object')

In [17]:
sorted_index = df.sort_index()

df = sorted_index

print(df)

   values
a     200
b     300
c     100
d     400
e     800
f     450
g     100

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
df.head(3)

   values
a     200
b     300
c     100

In [19]:
df.tail(3)

   values
e     800
f     450
g     100

Rename the column of the dataframe as 'points'

In [20]:
df.columns=['points']
df

   points
a     200
b     300
c     100
d     400
e     800
f     450
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [21]:
#Create fruits array

fruits_list = ['orange','mango','apple']

In [22]:
#Create series fruits out of fruits array

fruits = pd.Series(np.random.choice(fruits_list, size=7))

print(fruits)

0     mango
1     mango
2     mango
3     mango
4     mango
5    orange
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

In [23]:
new_index = df.index

fruits.index = new_index

print(fruits)

a     mango
b     mango
c     mango
d     mango
e     mango
f    orange
g     mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [24]:
df['fruits']= fruits

print(df)

   points  fruits
a     200   mango
b     300   mango
c     100   mango
d     400   mango
e     800   mango
f     450  orange
g     100   mango

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [25]:
d1 = pd.DataFrame({ 'city' : ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ],'Temperature' : [15, 22, 20, 26,-2]})

Print(d1)

In [26]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [27]:
d1.shape

(5, 2)

Set city = d1['city']

In [28]:
city = d1['city']

d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

print city <br>
What is the type of city.

In [29]:
type(city)

pandas.core.series.Series

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [30]:
d2 = pd.DataFrame({'city' : ['Bengalaru','Coimbatore','Srirangam','Pondicherry'],'Temperature' : [24,35,36,39]})

print the shape of this dataframe

In [31]:
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

merge the two dataframes together, save it in a new dataframe named 'd3'

In [32]:
d3 = pd.concat([d1, d2],axis=0 )
print(d3)

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [33]:
cities = d3[d3['Temperature']<=20]

city_count= len(cities)

print(city_count)

3

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [34]:
cities = d3[d3["Temperature"]>=35]
city_count = len(cities)
print(city_count)

3

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [35]:
# write function here
union_territory = ['Chandigarh', 'Pondicherry','Delhi']

def is_ut(city):
    return city in union_territory
        
d3['is_ut'] = d3['city'].apply(is_ut)

In [36]:
# print d3

d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [37]:
# write function here

def c_to_f(Temperature):
    return (Temperature * 9/5) + 32

In [38]:
# check function c_to_f(10)
def c_to_f(Temperature):
    ferenheit = (Temperature * 9/5) + 32
    return ferenheit

print(c_to_f(10))

50.0

In [39]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['temp_farenhiet'] = d3['Temperature'].apply(c_to_f)
print(d3)

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengalaru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [40]:
union_territory = ['Chandigarh', 'Pondicherry','Delhi']

subset_ut = d1[d1['city'].isin(union_territory)]

print(subset_ut)

         city  Temperature
0  Chandigarh           15
1       Delhi           22

##Select a subset of the dataframe d3 such that it contains the cities which only have temperature above 90 Farenhiet.

In [41]:
farenhiet_above_90 = d3[d3['temp_farenhiet']>90]
print(farenhiet_above_90)

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

Select only the first three rows of the dataframe d3.

In [42]:
d3.head(3)

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

In [43]:
d3.iloc[:3]

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

In [44]:
d3.iloc[:,-2:]

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3   True           102.2

## Groupby

In [45]:
# Create a dataframe using dictionary of your choice

data = pd.DataFrame({'Team':['India','Austalia', 'India','S.Africa','Shrilanka'],'Players':['Virat','Warner', 'Virat','A.B.Deviliars','Malinga'],"Score":[100,60,80,80,40]})
print(data)

        Team        Players  Score
0      India          Virat    100
1   Austalia         Warner     60
2      India          Virat     80
3   S.Africa  A.B.Deviliars     80
4  Shrilanka        Malinga     40

In [46]:
# Use Groupby of single column with aggregate sum()

score_sum = data.groupby('Players').sum()
score_sum

C:\Users\USER\AppData\Local\Temp\ipykernel_16908\1525992706.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  score_sum = data.groupby('Players').sum()

               Score
Players
A.B.Deviliars     80
Malinga           40
Virat            180
Warner            60

In [47]:
# Use Groupby of single column with aggregate count()

score_count = data.groupby('Players').count()
score_count

               Team  Score
Players
A.B.Deviliars     1      1
Malinga           1      1
Virat             2      2
Warner            1      1

In [48]:
# Use Groupby of single column with aggregate min() and max()

score_min = data.groupby('Players').min()
score_max = data.groupby('Players').max()

print(score_min) 
print("  ")
print(score_max)

                    Team  Score
Players
A.B.Deviliars   S.Africa     80
Malinga        Shrilanka     40
Virat              India     80
Warner          Austalia     60

                    Team  Score
Players
A.B.Deviliars   S.Africa     80
Malinga        Shrilanka     40
Virat              India    100
Warner          Austalia     60

In [49]:
# Use Groupby of any 2 columns with aggregate mean()

team_mean = data.groupby(['Team','Players']).mean()
team_mean

                         Score
Team      Players
Austalia  Warner          60.0
India     Virat           90.0
S.Africa  A.B.Deviliars   80.0
Shrilanka Malinga         40.0

In [50]:
# Use Groupby of any 2 columns with aggregate min() and max()

team_min_max = data.groupby(['Players', 'Team'])['Score'].agg(['min', 'max'])


team_min_max

                         min  max
Players       Team
A.B.Deviliars S.Africa    80   80
Malinga       Shrilanka   40   40
Virat         India       80  100
Warner        Austalia    60   60

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [51]:
a = pd.date_range(start='1st of January,2020', end='1st of April 2021')

print a

In [52]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [53]:
print("Length of a:", len(a))

Length of a: 457

What is the type of a?

In [54]:
print("Type of a:", type(a))

Type of a: <class 'pandas.core.indexes.datetimes.DatetimeIndex'>